[
  {
    "chapter": 2,
    "verse": 11,
    "explanation": "You are worrying too much about things that cannot harm your true self. Calm your heart. What truly matters will always remain with you.",
    "tags": ["wisdom", "peace", "confusion"]
  },
  {
    "chapter": 2,
    "verse": 13,
    "explanation": "You are changing every moment, just like life around you. Do not fear change. Accept it calmly and move forward with confidence.",
    "tags": ["acceptance", "growth", "confidence"]
  },
  {
    "chapter": 2,
    "verse": 14,
    "explanation": "The pain you are feeling right now will not last forever. Happiness and sadness come and go in life. Stay calm and steady, and this phase will pass.",
    "tags": ["sadness", "suffering", "balance"]
  },
  {
    "chapter": 2,
    "verse": 15,
    "explanation": "Do not let suffering make you weak. Stay steady. Strength will return to you.",
    "tags": ["suffering", "confidence", "strength"]
  },
  {
    "chapter": 2,
    "verse": 27,
    "explanation": "Everything that comes into life will change one day. Accept this truth, and your fear will reduce.",
    "tags": ["acceptance", "fear", "wisdom"]
  },
  {
    "chapter": 2,
    "verse": 38,
    "explanation": "Do not let success excite you or failure break you. Stay balanced in both. This balance will make you strong inside.",
    "tags": ["balance", "confidence", "wisdom"]
  },
  {
    "chapter": 2,
    "verse": 47,
    "explanation": "You are feeling confused because you are thinking too much about results. Focus only on doing your duty honestly and sincerely. When you let go of fear about outcomes, peace will come to you.",
    "tags": ["action", "duty", "detachment"]
  },
  {
    "chapter": 2,
    "verse": 48,
    "explanation": "Stay balanced whether you succeed or fail. Do your work sincerely, without letting stress control you. Balance will keep your mind peaceful.",
    "tags": ["balance", "stress", "peace"]
  },
  {
    "chapter": 2,
    "verse": 49,
    "explanation": "Do your work with understanding, not greed. When you act wisely, stress reduces and clarity increases.",
    "tags": ["wisdom", "action", "stress"]
  },
  {
    "chapter": 2,
    "verse": 50,
    "explanation": "You feel stressed because you are judging yourself too much by success and failure. Use wisdom in your actions and stay balanced. When you rise above worry, clarity will come.",
    "tags": ["stress", "wisdom", "balance"]
  },
  {
    "chapter": 2,
    "verse": 55,
    "explanation": "Your mind is disturbed because of too many desires. Let go of what is unnecessary. True peace comes when you feel content inside.",
    "tags": ["desire", "peace", "self_control"]
  },
  {
    "chapter": 2,
    "verse": 56,
    "explanation": "Even when difficulties arise, remain steady. Do not let sorrow shake your mind. Emotional balance will help you move through challenges.",
    "tags": ["sadness", "balance", "strength"]
  },
  {
    "chapter": 2,
    "verse": 58,
    "explanation": "You feel disturbed because your senses pull you everywhere. Learn to step back when needed. Control will bring calmness.",
    "tags": ["self_control", "peace", "discipline"]
  },
  {
    "chapter": 2,
    "verse": 62,
    "explanation": "Your mind becomes restless when it keeps thinking about desires. Notice these thoughts and gently step back. Freedom comes when you do not let desire control you.",
    "tags": ["desire", "self_control", "peace"]
  },
  {
    "chapter": 2,
    "verse": 63,
    "explanation": "Attachment can lead to anger and pain when expectations are not met. Anger is troubling you and making your thoughts unclear. Pause and calm yourself before reacting. When anger fades, your peace and understanding will return.",
    "tags": ["anger", "attachment", "peace"]
  },
  {
    "chapter": 2,
    "verse": 64,
    "explanation": "When you stay free from strong likes and dislikes, your mind becomes peaceful. Balance your emotions, and happiness will follow.",
    "tags": ["balance", "peace", "self_control"]
  },
  {
    "chapter": 3,
    "verse": 5,
    "explanation": "You cannot avoid action in life, even when you feel tired. Accept this and do your part honestly. Action done with awareness brings strength.",
    "tags": ["action", "duty", "strength"]
  },
  {
    "chapter": 3,
    "verse": 6,
    "explanation": "Be honest with yourself. Do not pretend to be calm while your actions are uncontrolled. True discipline starts from within.",
    "tags": ["discipline", "self_control", "honesty"]
  },
  {
    "chapter": 3,
    "verse": 7,
    "explanation": "Do your actions with awareness and control. When you act consciously, your mind feels peaceful and confident.",
    "tags": ["action", "self_control", "confidence"]
  },
  {
    "chapter": 3,
    "verse": 8,
    "explanation": "Do not give up or remain inactive. Even small effort is better than doing nothing. Keep moving forward, and strength will return to you.",
    "tags": ["action", "confidence", "strength"]
  },
  {
    "chapter": 3,
    "verse": 16,
    "explanation": "Live responsibly and in harmony with life. When you respect this balance, peace will naturally follow you.",
    "tags": ["duty", "balance", "peace"]
  },
  {
    "chapter": 3,
    "verse": 19,
    "explanation": "Do your work with honesty, without expecting praise or reward. When you act without attachment, your mind feels lighter and more peaceful.",
    "tags": ["action", "detachment", "peace"]
  },
  {
    "chapter": 3,
    "verse": 21,
    "explanation": "People learn by watching you. Act responsibly and with care. Your actions can guide others in the right direction.",
    "tags": ["duty", "responsibility", "leadership"]
  },
  {
    "chapter": 3,
    "verse": 30,
    "explanation": "Let go of ego and stop thinking that you must control everything. Offer your actions with sincerity, and your heart will feel free and calm.",
    "tags": ["detachment", "peace", "humility"]
  },
  {
    "chapter": 3,
    "verse": 34,
    "explanation": "Attraction and dislike are natural, but do not let them control your actions. Real love is guided by understanding.",
    "tags": ["self_control", "attachment", "wisdom"]
  },
  {
    "chapter": 4,
    "verse": 7,
    "explanation": "When life feels unfair or dark, do not lose hope. Remember that goodness always finds its way back. Trust that justice and balance will return.",
    "tags": ["hope", "faith", "balance"]
  },
  {
    "chapter": 4,
    "verse": 10,
    "explanation": "Let go of fear, anger, and attachment. When you release these burdens, your heart becomes light and calm.",
    "tags": ["fear", "anger", "detachment"]
  },
  {
    "chapter": 4,
    "verse": 16,
    "explanation": "You may feel confused about what is right to do. Think calmly and look at your intention. Clarity comes with understanding.",
    "tags": ["confusion", "wisdom", "clarity"]
  },
  {
    "chapter": 4,
    "verse": 18,
    "explanation": "You may feel confused about what action is right. Look deeper at your intention, not just the action itself. Wisdom will guide you when your purpose is pure.",
    "tags": ["confusion", "wisdom", "action"]
  },
  {
    "chapter": 4,
    "verse": 20,
    "explanation": "Do your work without worrying too much about results. Stress comes from attachment. Freedom comes when you let go.",
    "tags": ["detachment", "stress", "freedom"]
  },
  {
    "chapter": 4,
    "verse": 22,
    "explanation": "Stop comparing yourself with others. Be content with what comes honestly to you. Contentment brings deep peace.",
    "tags": ["contentment", "peace", "self_acceptance"]
  },
  {
    "chapter": 4,
    "verse": 33,
    "explanation": "Do not follow rituals blindly. Try to understand their meaning. True knowledge will help you grow wisely.",
    "tags": ["wisdom", "knowledge", "growth"]
  },
  {
    "chapter": 4,
    "verse": 36,
    "explanation": "Do not feel stuck because of past mistakes. Learning and awareness can lift you up. Change is always possible.",
    "tags": ["growth", "healing", "confidence"]
  },
  {
    "chapter": 4,
    "verse": 38,
    "explanation": "If you feel lost or unsure, seek true knowledge. Learning and understanding will slowly remove confusion and bring confidence.",
    "tags": ["confusion", "wisdom", "confidence"]
  },
  {
    "chapter": 5,
    "verse": 12,
    "explanation": "Do not take too much stress about results. Focus on doing your best. Peace comes when you release anxiety about outcomes.",
    "tags": ["stress", "detachment", "peace"]
  },
  {
    "chapter": 5,
    "verse": 18,
    "explanation": "Do not judge people by status or appearance. When you see everyone with equal respect, your heart becomes lighter and more peaceful.",
    "tags": ["compassion", "equality", "peace"]
  },
  {
    "chapter": 5,
    "verse": 22,
    "explanation": "Pleasure that depends on someone else often brings pain later. Seek love that gives peace, not anxiety.",
    "tags": ["attachment", "suffering", "wisdom"]
  },
  {
    "chapter": 5,
    "verse": 23,
    "explanation": "Control your desires before they control you. Self-control protects your peace and keeps your mind stable.",
    "tags": ["self_control", "desire", "peace"]
  },
  {
    "chapter": 5,
    "verse": 24,
    "explanation": "Do not search for happiness outside. Look within yourself. Inner peace brings lasting joy.",
    "tags": ["peace", "self_awareness", "wisdom"]
  },
  {
    "chapter": 5,
    "verse": 26,
    "explanation": "Anger is stealing your happiness. Let it go slowly. Peace returns when anger is controlled.",
    "tags": ["anger", "self_control", "peace"]
  },
  {
    "chapter": 5,
    "verse": 27,
    "explanation": "Your senses pull you in many directions, and that is why you feel disturbed. Gently control them and turn inward. Calmness will naturally grow.",
    "tags": ["self_control", "peace", "discipline"]
  },
  {
    "chapter": 5,
    "verse": 29,
    "explanation": "When you understand life clearly, your worries reduce. This understanding brings calmness and peace.",
    "tags": ["wisdom", "peace", "clarity"]
  },
  {
    "chapter": 6,
    "verse": 5,
    "explanation": "Do not doubt yourself. You have the strength to rise through your own effort. Take responsibility for your growth, and slowly you will see positive change.",
    "tags": ["confidence", "growth", "self_effort"]
  },
  {
    "chapter": 6,
    "verse": 6,
    "explanation": "Your mind can either support you or trouble you. Learn to guide it gently instead of letting it control you. When your thoughts are disciplined, peace will follow.",
    "tags": ["self_control", "discipline", "peace"]
  },
  {
    "chapter": 6,
    "verse": 7,
    "explanation": "When your mind is calm and under control, clarity comes naturally. Calmness is your real strength.",
    "tags": ["peace", "clarity", "strength"]
  },
  {
    "chapter": 6,
    "verse": 10,
    "explanation": "Make time regularly to sit quietly and reflect. This practice will help you feel calm and focused.",
    "tags": ["practice", "peace", "focus"]
  },
  {
    "chapter": 6,
    "verse": 11,
    "explanation": "Choose a clean and calm place for yourself. A peaceful environment helps your mind relax and settle.",
    "tags": ["peace", "environment", "calmness"]
  },
  {
    "chapter": 6,
    "verse": 12,
    "explanation": "When your mind wanders, gently bring it back. Do not be harsh on yourself. Peace grows with practice.",
    "tags": ["practice", "self_control", "peace"]
  },
  {
    "chapter": 6,
    "verse": 16,
    "explanation": "Your life feels unbalanced because your habits are extreme. Bring moderation to eating, sleeping, and working. Balance will restore your peace.",
    "tags": ["balance", "discipline", "peace"]
  },
  {
    "chapter": 6,
    "verse": 18,
    "explanation": "When your mind becomes calm and controlled, peace grows naturally. Practice gently, without forcing yourself.",
    "tags": ["peace", "self_control", "practice"]
  },
  {
    "chapter": 6,
    "verse": 23,
    "explanation": "Suffering feels heavy right now, but it does not define you. Through inner discipline and awareness, you can slowly move beyond pain.",
    "tags": ["suffering", "healing", "self_control"]
  },
  {
    "chapter": 6,
    "verse": 26,
    "explanation": "When your mind wanders, gently bring it back. Do not get frustrated with yourself. Calm focus will grow with practice.",
    "tags": ["practice", "focus", "peace"]
  },
  {
    "chapter": 6,
    "verse": 32,
    "explanation": "See others as you see yourself. When you feel compassion, your heart becomes softer and happier.",
    "tags": ["compassion", "empathy", "peace"]
  },
  {
    "chapter": 7,
    "verse": 3,
    "explanation": "It may feel lonely to walk a meaningful path, but do not feel discouraged. Your sincere effort itself makes you strong and special.",
    "tags": ["confidence", "effort", "growth"]
  },
  {
    "chapter": 7,
    "verse": 11,
    "explanation": "True strength does not come from ego. Be strong with humility. This kind of strength brings respect and peace.",
    "tags": ["humility", "strength", "peace"]
  },
  {
    "chapter": 7,
    "verse": 14,
    "explanation": "Life may feel confusing and heavy at times. Surrender your worries and trust. Clarity will slowly return.",
    "tags": ["confusion", "faith", "peace"]
  },
  {
    "chapter": 7,
    "verse": 15,
    "explanation": "Ego and ignorance are blocking your growth. Let go of pride and stay open to learning. Humility will lead you forward.",
    "tags": ["ego", "humility", "growth"]
  },
  {
    "chapter": 7,
    "verse": 17,
    "explanation": "Do not ignore the value of true understanding. When you seek wisdom with sincerity, your life slowly becomes clear and meaningful.",
    "tags": ["wisdom", "growth", "clarity"]
  },
  {
    "chapter": 7,
    "verse": 19,
    "explanation": "Do not rush for answers. Wisdom grows slowly through experience and patience. Trust the journey.",
    "tags": ["patience", "wisdom", "growth"]
  },
  {
    "chapter": 8,
    "verse": 5,
    "explanation": "Your thoughts shape your direction in life. Keep your mind focused on what is pure and meaningful. This focus will guide your future.",
    "tags": ["focus", "growth", "clarity"]
  },
  {
    "chapter": 8,
    "verse": 6,
    "explanation": "Your thoughts guide your future. Keep your mind on positive and meaningful things. This will shape a better path for you.",
    "tags": ["focus", "growth", "confidence"]
  },
  {
    "chapter": 8,
    "verse": 7,
    "explanation": "While doing your work, do not forget your purpose. Stay focused on what truly matters, and your actions will bring peace.",
    "tags": ["action", "purpose", "peace"]
  },
  {
    "chapter": 8,
    "verse": 28,
    "explanation": "Focus on improving yourself from within. Inner growth will guide your life better than external rewards.",
    "tags": ["growth", "self_awareness", "wisdom"]
  },
  {
    "chapter": 9,
    "verse": 22,
    "explanation": "When you place your trust sincerely, you are never alone. Stay faithful and focused, and your needs will be taken care of.",
    "tags": ["faith", "trust", "peace"]
  },
  {
    "chapter": 9,
    "verse": 26,
    "explanation": "What matters is not how much you offer, but how sincerely you offer it. Simple devotion brings deep peace.",
    "tags": ["devotion", "peace", "sincerity"]
  },
  {
    "chapter": 9,
    "verse": 29,
    "explanation": "Do not feel less or separated. All are equal in value. When you act with love and fairness, your heart will feel peaceful.",
    "tags": ["equality", "compassion", "peace"]
  },
  {
    "chapter": 9,
    "verse": 31,
    "explanation": "Even if you feel broken or lost right now, do not lose hope. You can change and rise again. Take one honest step forward.",
    "tags": ["healing", "hope", "confidence"]
  },
  {
    "chapter": 9,
    "verse": 34,
    "explanation": "Keep your heart connected to what gives you strength. This connection removes fear and confusion.",
    "tags": ["faith", "strength", "clarity"]
  },
  {
    "chapter": 10,
    "verse": 4,
    "explanation": "Clarity comes when your mind is sincere and open. Trust your inner wisdom, and confusion will slowly fade away.",
    "tags": ["wisdom", "clarity", "confusion"]
  },
  {
    "chapter": 10,
    "verse": 8,
    "explanation": "When you feel lost, remember that everything has a deeper source. Trust this truth, and fear will slowly fade away.",
    "tags": ["faith", "fear", "peace"]
  },
  {
    "chapter": 10,
    "verse": 9,
    "explanation": "Joy comes when your heart is filled with devotion and trust. Let your mind rest in this happiness.",
    "tags": ["devotion", "joy", "peace"]
  },
  {
    "chapter": 10,
    "verse": 10,
    "explanation": "When you walk sincerely and honestly, guidance comes naturally. Trust that you will be shown the right way.",
    "tags": ["guidance", "faith", "trust"]
  },
  {
    "chapter": 10,
    "verse": 11,
    "explanation": "When you walk honestly and sincerely, guidance comes from within. Trust this inner light.",
    "tags": ["guidance", "wisdom", "faith"]
  },
  {
    "chapter": 10,
    "verse": 22,
    "explanation": "Look around you and see excellence and goodness. This presence gives strength and confidence when you feel weak.",
    "tags": ["confidence", "strength", "inspiration"]
  },
  {
    "chapter": 11,
    "verse": 32,
    "explanation": "Change may feel scary, but it is a part of life. Accept it calmly, and you will learn to move forward without fear.",
    "tags": ["acceptance", "change", "fear"]
  },
  {
    "chapter": 11,
    "verse": 33,
    "explanation": "Rise with courage and do what must be done. Do not run from responsibility. Strength will come once you take the first step.",
    "tags": ["courage", "responsibility", "action"]
  },
  {
    "chapter": 11,
    "verse": 54,
    "explanation": "You may feel unsure about your path, but simple devotion will guide you. Do not let pride or doubt disturb you. Stay sincere, and understanding will come.",
    "tags": ["devotion", "faith", "clarity"]
  },
  {
    "chapter": 12,
    "verse": 13,
    "explanation": "Choose kindness in your thoughts and actions. Compassion will bring you closer to peace and strengthen your relationships.",
    "tags": ["compassion", "kindness", "peace"]
  },
  {
    "chapter": 12,
    "verse": 14,
    "explanation": "Be content with what you have and grateful in your heart. Contentment brings lasting peace.",
    "tags": ["contentment", "gratitude", "peace"]
  },
  {
    "chapter": 12,
    "verse": 15,
    "explanation": "True love does not disturb or hurt others. If your feelings bring peace and kindness, it is love. If they bring fear or restlessness, look deeper.",
    "tags": ["love", "peace", "self_reflection"]
  },
  {
    "chapter": 12,
    "verse": 16,
    "explanation": "Love should not depend on expectations. When you love without demanding anything in return, your heart remains peaceful.",
    "tags": ["love", "detachment", "peace"]
  },
  {
    "chapter": 12,
    "verse": 17,
    "explanation": "Do not let joy make you proud or sorrow make you weak. Stay steady in both. This balance will protect your peace.",
    "tags": ["balance", "emotional_control", "peace"]
  },
  {
    "chapter": 12,
    "verse": 18,
    "explanation": "Do not let emotions control how you treat others. Stay balanced with both friend and enemy. This maturity will protect your peace.",
    "tags": ["maturity", "balance", "peace"]
  },
  {
    "chapter": 12,
    "verse": 19,
    "explanation": "Stay calm even when others praise or criticize you. Emotional balance will protect your inner peace.",
    "tags": ["emotional_control", "peace", "confidence"]
  },
  {
    "chapter": 12,
    "verse": 20,
    "explanation": "Stay consistent and patient in your efforts. Peace grows slowly through steady practice.",
    "tags": ["patience", "practice", "peace"]
  },
  {
    "chapter": 13,
    "verse": 8,
    "explanation": "True wisdom begins with humility. Let go of pride and stay simple. This will bring clarity and growth.",
    "tags": ["wisdom", "humility", "growth"]
  },
  {
    "chapter": 13,
    "verse": 9,
    "explanation": "Your mind feels clearer when you let go of unnecessary attachment. Do not hold on too tightly. Freedom begins when you release.",
    "tags": ["detachment", "freedom", "clarity"]
  },
  {
    "chapter": 13,
    "verse": 11,
    "explanation": "Stay sincere in your path. When your heart is honest, confusion will slowly disappear.",
    "tags": ["sincerity", "confusion", "clarity"]
  },
  {
    "chapter": 13,
    "verse": 12,
    "explanation": "Spend time understanding yourself. When you know your inner nature, confusion reduces and clarity grows.",
    "tags": ["self_awareness", "clarity", "growth"]
  },
  {
    "chapter": 14,
    "verse": 22,
    "explanation": "Your moods may change, but do not let them control you. Stay steady within yourself. Inner balance brings lasting peace.",
    "tags": ["emotional_control", "balance", "peace"]
  },
  {
    "chapter": 14,
    "verse": 24,
    "explanation": "Life brings both happiness and difficulty. Do not let either control you. Stay calm inside, and you will remain strong.",
    "tags": ["balance", "strength", "peace"]
  },
  {
    "chapter": 14,
    "verse": 25,
    "explanation": "Do not let praise or blame disturb you. Stay steady within yourself. This steadiness is true freedom.",
    "tags": ["detachment", "freedom", "emotional_control"]
  },
  {
    "chapter": 14,
    "verse": 26,
    "explanation": "Hold on to faith even when fear appears. When your devotion is steady, limitations will no longer control you.",
    "tags": ["faith", "devotion", "freedom"]
  },
  {
    "chapter": 15,
    "verse": 5,
    "explanation": "Ego and pride are holding you back. Let them go gently. Humility will open the door to freedom and peace.",
    "tags": ["ego", "humility", "peace"]
  },
  {
    "chapter": 15,
    "verse": 7,
    "explanation": "Remember this clearly: you are not alone or weak. You are a part of something greater. When you understand your true value, fear and doubt will slowly disappear.",
    "tags": ["confidence", "faith", "fear"]
  },
  {
    "chapter": 15,
    "verse": 11,
    "explanation": "Keep putting in effort, even when results are not visible. Awareness and understanding grow slowly through sincere effort.",
    "tags": ["effort", "growth", "patience"]
  },
  {
    "chapter": 15,
    "verse": 19,
    "explanation": "Seek understanding instead of confusion. When you understand clearly, your mind feels free.",
    "tags": ["wisdom", "clarity", "freedom"]
  },
  {
    "chapter": 16,
    "verse": 1,
    "explanation": "Fearlessness grows when your heart is pure and honest. Build your character with truth and discipline. Inner strength will naturally develop.",
    "tags": ["fearlessness", "discipline", "strength"]
  },
  {
    "chapter": 16,
    "verse": 2,
    "explanation": "Choose truth and kindness in your actions. When you live with honesty and non-violence, your heart feels lighter and peaceful.",
    "tags": ["truth", "kindness", "peace"]
  },
  {
    "chapter": 16,
    "verse": 3,
    "explanation": "Build your life on good values like patience, honesty, and self-control. These qualities will make you strong from within.",
    "tags": ["values", "self_control", "strength"]
  },
  {
    "chapter": 16,
    "verse": 7,
    "explanation": "Think calmly before acting. Awareness will protect you from regret and inner conflict.",
    "tags": ["awareness", "wisdom", "clarity"]
  },
  {
    "chapter": 16,
    "verse": 21,
    "explanation": "Desire, anger, and greed are troubling your peace. These habits slowly pull you down. Step back, stay aware, and choose a calmer path.",
    "tags": ["desire", "anger", "self_control"]
  },
  {
    "chapter": 17,
    "verse": 15,
    "explanation": "Speak gently and truthfully. Your words have power. When your speech is kind, your relationships become peaceful.",
    "tags": ["speech", "kindness", "peace"]
  },
  {
    "chapter": 17,
    "verse": 16,
    "explanation": "Your mind feels restless because it lacks control. Slow your thoughts and be gentle with yourself. Mental peace will come through self-discipline.",
    "tags": ["self_control", "discipline", "peace"]
  },
  {
    "chapter": 17,
    "verse": 20,
    "explanation": "Give without expecting anything in return. Selfless giving cleans your heart and brings quiet happiness.",
    "tags": ["selflessness", "giving", "peace"]
  },
  {
    "chapter": 18,
    "verse": 5,
    "explanation": "Serve and act without expecting rewards. Selfless actions purify your heart and bring peace.",
    "tags": ["service", "selflessness", "peace"]
  },
  {
    "chapter": 18,
    "verse": 14,
    "explanation": "Remember that success does not depend on you alone. Your effort matters, but circumstances also play a role. Do your best and release worry.",
    "tags": ["effort", "acceptance", "peace"]
  },
  {
    "chapter": 18,
    "verse": 26,
    "explanation": "Work with dedication, but do not let ego guide you. When you stay calm and focused, your effort becomes meaningful.",
    "tags": ["dedication", "ego", "focus"]
  },
  {
    "chapter": 18,
    "verse": 30,
    "explanation": "You are confused about what is right and wrong. Take a moment to think calmly. When your mind is clear, right decisions become easier.",
    "tags": ["confusion", "clarity", "wisdom"]
  },
  {
    "chapter": 18,
    "verse": 31,
    "explanation": "Before acting, understand what is right and what is wrong. Clear thinking will guide you toward better decisions.",
    "tags": ["wisdom", "decision", "clarity"]
  },
  {
    "chapter": 18,
    "verse": 33,
    "explanation": "True determination grows through discipline and patience. Stay focused on your path, even when progress feels slow.",
    "tags": ["determination", "discipline", "patience"]
  },
  {
    "chapter": 18,
    "verse": 35,
    "explanation": "Be careful of habits that pull you toward fear and negativity. Choose discipline and awareness, and you will regain control.",
    "tags": ["fear", "discipline", "self_control"]
  },
  {
    "chapter": 18,
    "verse": 36,
    "explanation": "Mental peace may feel hard at first, but it grows with patience.",
    "tags": ["peace", "patience", "practice"]
  },
  {
    "chapter": 18,
    "verse": 37,
    "explanation": "Some feelings feel sweet at first but cause pain later. Love that is right for you will bring long-lasting peace.",
    "tags": ["attachment", "wisdom", "peace"]
  },
  {
    "chapter": 18,
    "verse": 58,
    "explanation": "Trust me and stop worrying so much. When you move forward with faith, many obstacles will slowly disappear from your path.",
    "tags": ["faith", "trust", "confidence"]
  },
  {
    "chapter": 18,
    "verse": 63,
    "explanation": "Do not rush into action. Think calmly and clearly. When you decide with awareness, you will not regret your choices.",
    "tags": ["awareness", "decision", "clarity"]
  },
  {
    "chapter": 18,
    "verse": 66,
    "explanation": "Release your fear and stop carrying everything alone. Trust deeply and move forward with faith. When you surrender your worries, you will feel protected.",
    "tags": ["surrender", "faith", "peace"]
  },
  {
    "chapter": 2,
    "verse": 17,
    "explanation": "What you have lost cannot be destroyed at its deepest level. I know your pain feels unbearable right now, but what truly matters within you still remains.",
    "tags": ["grief", "loss", "healing"]
  },
  {
    "chapter": 2,
    "verse": 20,
    "explanation": "Life does not end the way the body ends. The bond you miss is not gone forever. Take comfort in this truth and allow yourself time to grieve.",
    "tags": ["grief", "death", "acceptance"]
  },
  {
    "chapter": 2,
    "verse": 23,
    "explanation": "What happened to you was not your fault. No one has the right to harm your dignity. Your inner self remains untouched and pure.",
    "tags": ["trauma", "dignity", "healing"]
  },
  {
    "chapter": 2,
    "verse": 25,
    "explanation": "You may feel broken and invisible right now, but you are not weak. Nothing that happened has reduced your worth.",
    "tags": ["trauma", "self_worth", "confidence"]
  },
  {
    "chapter": 2,
    "verse": 30,
    "explanation": "Death feels cruel and unfair when it takes someone you love. Allow your tears to flow. Grief is not weakness.",
    "tags": ["grief", "death", "compassion"]
  },
  {
    "chapter": 6,
    "verse": 22,
    "explanation": "Even in deep suffering, a time will come when this pain loosens its grip. Hold on gently. Healing happens slowly.",
    "tags": ["suffering", "healing", "hope"]
  },
  {
    "chapter": 6,
    "verse": 27,
    "explanation": "Your mind feels shattered because of what you went through. Peace will not come suddenly, but it will return step by step.",
    "tags": ["trauma", "healing", "peace"]
  },
  {
    "chapter": 9,
    "verse": 16,
    "explanation": "You are not abandoned, even when life feels cruel. You are seen, heard, and held, even in silence.",
    "tags": ["faith", "comfort", "hope"]
  },
  {
    "chapter": 9,
    "verse": 32,
    "explanation": "No matter what has happened to you, you are never impure or lesser. You deserve respect, safety, and compassion.",
    "tags": ["dignity", "trauma", "compassion"]
  },
  {
    "chapter": 11,
    "verse": 50,
    "explanation": "After shock and fear, the heart needs gentleness. Be kind to yourself. Recovery does not mean forgetting.",
    "tags": ["shock", "healing", "self_compassion"]
  },
  {
    "chapter": 13,
    "verse": 27,
    "explanation": "Do not blame yourself for suffering. Pain happens in the world, but your value is never reduced by it.",
    "tags": ["self_worth", "suffering", "healing"]
  },
  {
    "chapter": 13,
    "verse": 31,
    "explanation": "Life’s injustice does not mean you are cursed. Sometimes suffering comes without reason, and healing comes without explanation.",
    "tags": ["injustice", "suffering", "acceptance"]
  },
  {
    "chapter": 15,
    "verse": 16,
    "explanation": "Your pain does not define who you are. You are more than what happened to you.",
    "tags": ["identity", "trauma", "healing"]
  },
  {
    "chapter": 18,
    "verse": 66,
    "explanation": "When the weight feels too heavy, stop carrying it alone. Rest your heart. You are allowed to seek help and comfort.",
    "tags": ["surrender", "support", "healing"]
  },
  {
    "chapter": 18,
    "verse": 78,
    "explanation": "Where truth and compassion exist, strength will slowly return. Even broken lives can heal.",
    "tags": ["hope", "healing", "strength"]
  }
]